stress-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 10          # 10 saniye boyunca (Isınma Turu)
      arrivalRate: 1        # Saniyede 1 yeni kullanıcı gelsin
      name: Warm up

    - duration: 20          # 20 saniye boyunca (Yüklenmeye Başla)
      arrivalRate: 5        # Saniyede 5 kullanıcıdan
      rampTo: 20            # Saniyede 20 kullanıcıya kadar çık
      name: Ramp up load

    - duration: 30          # 30 saniye boyunca (Stres Testi)
      arrivalRate: 20       # Saniyede 20 kullanıcı sürekli saldırsın
      name: Sustained load

scenarios:
  - flow:
      - get:
          url: "/api/places"  # Her kullanıcı mekanları listelesin